PCSmithy/pcs_bldc/sw/lib/c/shared/hw/ADC/stm32g4/HW_ADC.c
/* Includes */

#include "lib_types.h"

#include "HW_ADC.h"
#include "stm32g4xx_hal.h"

/* Defines */

// HAL_ADC_PollForConversion timeout. Per-conversion polled wait at
// fast sampling on the G4 is sub-microsecond, so a few ms of headroom
// is essentially infinite while still bounding the worst case if the
// peripheral hangs.
#define HW_ADC_POLL_TIMEOUT_MS    (2U)

// Alias the HAL InjectedConvCpltCallback onto our canonical naming convention
#define HW_ADC_private_injectedConversionSequenceCompleteCallback HAL_ADCEx_InjectedConvCpltCallback
#define HW_ADC_private_errorCallback HAL_ADC_ErrorCallback

/* Typedefs */

typedef struct
{
    // Library-owned mutable HAL handles (HAL_ADC_* mutates state inside
    // these). Initialized by copying from the user's const config.
    ADC_HandleTypeDef hadc;

    // Per-channel derived state.
    uint8_t numEnabledInputs;
    uint8_t numEnabledInjectedInputs;

    // rankOrder[r] = physical IN# that occupies regular-sequence rank
    // (r+1). Built at init by walking the sparse inputs[] array; used at
    // run time to map "Nth conversion in the sequence" -> "which counts[]
    // slot to store it in".
    uint8_t rankOrder[HW_ADC_INPUTS_PER_CHANNEL];

    // Decoded resolution (bits) for the volts conversion.
    uint8_t numBits;

    // Regular-sequence results, indexed by physical IN# (sparse storage,
    // matches user's inputs[] indexing).
    uint32_t counts[HW_ADC_INPUTS_PER_CHANNEL];

    // Injected-sequence results, indexed by sequence position (dense,
    // matches user's injectedInputs[] indexing). Slot N holds the value
    // from injected rank N+1.
    uint32_t injectedCounts[HW_ADC_INJECTED_INPUTS_PER_CHANNEL];

    // Outcome of the most recent _run1ms pass on this channel.
    HW_ADC_conversionStatus_E status;

    HW_ADC_conversionStatus_E injectedConversionStatus;
    HW_ADC_injectedCallback_F injectedConversionCompleteCallback;
    void * injectedConversionCompleteCallbackContext;

    // Total HAL error-callback edges on this channel; never latches, never
    // clears except at init.
    uint32_t errorCount;

} HW_ADC_channelData_S;

typedef struct
{
    const HW_ADC_config_S * config;

    HW_ADC_channelData_S channelData[HW_ADC_CHANNEL_COUNT];

    bool initialized;
} HW_ADC_data_S;

/* Private Function Declarations */

static uint8_t HW_ADC_private_resolutionToNumBits(uint32_t resolution);
static bool    HW_ADC_private_rankToOrdinal(uint32_t rankConstant, uint8_t * const ordinal);
static bool    HW_ADC_private_initOneChannel(HW_ADC_channels_E channel);
static bool    HW_ADC_private_armTriggeredChannels(void);
static HW_ADC_channels_E HW_ADC_private_channelFromHandle(ADC_HandleTypeDef * hadc);

/* Private Data Definitions */

static HW_ADC_data_S HW_ADC_data;
static HW_ADC_data_S * const data = &HW_ADC_data;

static const uint32_t HW_ADC_injectedRankConstants[HW_ADC_INJECTED_INPUTS_PER_CHANNEL] =
{
    ADC_INJECTED_RANK_1, ADC_INJECTED_RANK_2, ADC_INJECTED_RANK_3, ADC_INJECTED_RANK_4,
};

static const uint32_t HW_ADC_injectedExternalTriggerMapping[HW_ADC_TIMER_TRIGGER_COUNT] =
{
    [HW_ADC_TIMER_TRIGGER_TIM1_TRGO2] = ADC_EXTERNALTRIGINJEC_T1_TRGO2,
};

/* Private Function Definitions */

static uint8_t HW_ADC_private_resolutionToNumBits(uint32_t resolution)
{
    switch (resolution)
    {
        case ADC_RESOLUTION_12B: return 12U;
        case ADC_RESOLUTION_10B: return 10U;
        case ADC_RESOLUTION_8B:  return 8U;
        case ADC_RESOLUTION_6B:  return 6U;
        default:                 return 12U;
    }
}

// The HAL regular-rank constants (ADC_REGULAR_RANK_n) are SQRx register-
// field encodings, not the ordinals 1..16 — e.g. RANK_1 == 6, RANK_2 == 12,
// RANK_3 == 18, RANK_6 == 262. Map a config's HAL rank constant back to its
// 1..N ordinal so the driver can order and validate the sequence. Returns
// false if the value isn't a recognized regular-rank constant.
static bool HW_ADC_private_rankToOrdinal(uint32_t rankConstant, uint8_t * const ordinal)
{
    static const uint32_t rankConstants[HW_ADC_INPUTS_PER_CHANNEL] =
    {
        ADC_REGULAR_RANK_1,  ADC_REGULAR_RANK_2,  ADC_REGULAR_RANK_3,  ADC_REGULAR_RANK_4,
        ADC_REGULAR_RANK_5,  ADC_REGULAR_RANK_6,  ADC_REGULAR_RANK_7,  ADC_REGULAR_RANK_8,
        ADC_REGULAR_RANK_9,  ADC_REGULAR_RANK_10, ADC_REGULAR_RANK_11, ADC_REGULAR_RANK_12,
        ADC_REGULAR_RANK_13, ADC_REGULAR_RANK_14, ADC_REGULAR_RANK_15, ADC_REGULAR_RANK_16,
    };

    bool found = false;
    for (uint8_t i = 0U; i < HW_ADC_INPUTS_PER_CHANNEL; i++)
    {
        if (rankConstants[i] == rankConstant)
        {
            *ordinal = i + 1U;   // 1..16
            found    = true;
            break;
        }
    }
    return found;
}

static bool HW_ADC_private_initOneChannel(HW_ADC_channels_E channel)
{
    bool ret = true;
    const HW_ADC_channelConfig_S * const channelConfig = &data->config->channels[channel];

    data->channelData[channel].errorCount = 0U;

    // Feature guard: reject trigger/transfer combinations the driver has not
    // built, rather than silently misconfiguring. Regular: software + polled
    // only. Injected: software + polled, or the timer-triggered interrupt
    // path with a mapped trigger source.
    if ((channelConfig->triggerMode != HW_ADC_TRIGGER_SOFTWARE) ||
        (channelConfig->xferMode    != HW_ADC_XFER_POLLED))
    {
        ret = false;
    }

    const bool injectedPolled    = ((channelConfig->injectedTriggerMode == HW_ADC_TRIGGER_SOFTWARE) &&
                                    (channelConfig->injectedXferMode    == HW_ADC_XFER_POLLED));
    const bool injectedTriggered = ((channelConfig->injectedTriggerMode == HW_ADC_TRIGGER_TIMER) &&
                                    (channelConfig->injectedXferMode    == HW_ADC_XFER_INTERRUPT) &&
                                    (channelConfig->injectedTimerTrigger < HW_ADC_TIMER_TRIGGER_COUNT));
    if ((!injectedPolled) && (!injectedTriggered))
    {
        ret = false;
    }

    // [impl->fw~hal_adc_002~1]
    // Walk the sparse regular inputs[] array, count enabled inputs, and
    // build the rank-ordered IN# list. Channel rank list must be contiguous
    uint8_t numEnabledRegular = 0U;
    uint8_t rankOrder[HW_ADC_INPUTS_PER_CHANNEL] = { 0 };
    bool    ordinalSeen[HW_ADC_INPUTS_PER_CHANNEL + 1U] = { false };
    if (ret)
    {
        for (uint8_t input = 0U; input < HW_ADC_INPUTS_PER_CHANNEL; input++)
        {
            if (channelConfig->inputs[input].enabled)
            {
                uint8_t ordinal = 0U;
                if ((!HW_ADC_private_rankToOrdinal(channelConfig->inputs[input].sConfig.Rank, &ordinal)) ||
                    (ordinalSeen[ordinal]))
                {
                    ret = false;
                    break;
                }
                ordinalSeen[ordinal]    = true;
                rankOrder[ordinal - 1U] = input;
                numEnabledRegular++;
            }
        }
    }

    // Enabled ordinals must be contiguous 1..numEnabledRegular (no gaps).
    if (ret)
    {
        for (uint8_t ordinal = 1U; ordinal <= numEnabledRegular; ordinal++)
        {
            if (!ordinalSeen[ordinal])
            {
                ret = false;
                break;
            }
        }
    }

    // Count enabled injected inputs. Storage is dense: slot N is rank
    // N+1. Enforce contiguous-from-zero (sparse like [0]=true, [2]=true
    // would silently skip slot 1's HAL config and mis-rank everything).
    uint8_t numEnabledInjected = 0U;
    if (ret)
    {
        bool seenDisabled = false;
        for (uint8_t i = 0U; i < HW_ADC_INJECTED_INPUTS_PER_CHANNEL; i++)
        {
            if (channelConfig->injectedInputs[i].enabled)
            {
                if (seenDisabled)
                {
                    // Gap in the sequence — reject.
                    ret = false;
                    break;
                }
                numEnabledInjected++;
            }
            else
            {
                seenDisabled = true;
            }
        }
    }

    // No-op success: peripheral listed but nothing enabled on either path.
    const bool needsHALInit = ((ret) && ((numEnabledRegular > 0U) || (numEnabledInjected > 0U)));
    if ((ret) && (!needsHALInit))
    {
        data->channelData[channel].numEnabledInputs         = 0U;
        data->channelData[channel].numEnabledInjectedInputs = 0U;
    }

    // Copy hadc to mutable storage; apply library-managed Init overrides
    // for the regular path. (Injected config doesn't touch hadc.Init —
    // those overrides happen per-input via HAL_ADCEx_InjectedConfigChannel.)
    if ((ret) && (needsHALInit))
    {
        data->channelData[channel].hadc = channelConfig->hadc;
        if (numEnabledRegular > 0U)
        {
            data->channelData[channel].hadc.Init.NbrOfConversion    = numEnabledRegular;
            data->channelData[channel].hadc.Init.ScanConvMode       = ((numEnabledRegular > 1U)) ? ADC_SCAN_ENABLE : ADC_SCAN_DISABLE;
            data->channelData[channel].hadc.Init.EOCSelection       = ADC_EOC_SINGLE_CONV;
            data->channelData[channel].hadc.Init.ContinuousConvMode = DISABLE;

            // AUTDLY holds the sequencer until DR is read: without it the HAL clears
            // EOC and EOS together and a preempted rank reads its successor's value.
            if (channelConfig->xferMode == HW_ADC_XFER_POLLED)
            {
                data->channelData[channel].hadc.Init.LowPowerAutoWait = ENABLE;
            }
        }
        switch (channelConfig->triggerMode)
        {
            case HW_ADC_TRIGGER_SOFTWARE:
                data->channelData[channel].hadc.Init.ExternalTrigConv = ADC_SOFTWARE_START;
                break;
            case HW_ADC_TRIGGER_TIMER:
            default:
                // TODO - support TIM trigger for regular conversions - map HW_ADC_timerTrigger_E to EXTSEL[4:0] to set ExternalTrigConv
                break;

