PCSmithy/pcs_bldc/sw/lib/c/shared/hw/ADC/stm32g4/HW_ADC.c
        }
        if (HAL_ADC_Init(&data->channelData[channel].hadc) != HAL_OK)
        {
            ret = false;
        }
    }

    // Calibrate. Single-ended; covers both regular and injected paths
    // (calibration is a peripheral-level operation on STM32G4).
    if ((ret) && (needsHALInit))
    {
        if (HAL_ADCEx_Calibration_Start(&data->channelData[channel].hadc, ADC_SINGLE_ENDED) != HAL_OK)
        {
            ret = false;
        }
    }

    // [impl->fw~hal_adc_007~1]
    if ((ret) && (needsHALInit) && (channelConfig->configureMultimode))
    {
        // HAL signature is non-const; the user's multimode struct is
        // const, hence the cast. Read-only access in practice.
        if (HAL_ADCEx_MultiModeConfigChannel(
                &data->channelData[channel].hadc,
                (ADC_MultiModeTypeDef *)&channelConfig->multimode) != HAL_OK)
        {
            ret = false;
        }
    }

    // Configure each enabled regular input's sequence rank.
    if ((ret) && (numEnabledRegular > 0U))
    {
        for (uint8_t input = 0U; input < HW_ADC_INPUTS_PER_CHANNEL; input++)
        {
            if (channelConfig->inputs[input].enabled)
            {
                ADC_ChannelConfTypeDef sConfig = channelConfig->inputs[input].sConfig;
                if (HAL_ADC_ConfigChannel(&data->channelData[channel].hadc, &sConfig) != HAL_OK)
                {
                    ret = false;
                    break;
                }
            }
        }
    }

    // Configure each enabled injected input. Library overrides
    // InjectedRank (from array position), InjectedNbrOfConversion (from
    // total count), and ExternalTrigInjecConv (from injectedTriggerMode);
    // user supplies channel + sampling time + the rest.
    //
    // Reference: ODrive uses these same HAL_ADCEx_Injected* APIs for
    // FOC current sensing on STM32F405 — see
    //   https://github.com/odriverobotics/ODrive
    if ((ret) && (numEnabledInjected > 0U))
    {
        for (uint8_t r = 0U; r < numEnabledInjected; r++)
        {
            ADC_InjectionConfTypeDef iConfig = channelConfig->injectedInputs[r].sConfig;
            iConfig.InjectedRank            = HW_ADC_injectedRankConstants[r];
            iConfig.InjectedNbrOfConversion = numEnabledInjected;

            // [impl->fw~hal_adc_003~1]
            switch (channelConfig->injectedTriggerMode)
            {
                default:
                case HW_ADC_TRIGGER_SOFTWARE:
                    iConfig.ExternalTrigInjecConv = ADC_INJECTED_SOFTWARE_START;
                    break;
                case HW_ADC_TRIGGER_TIMER:
                    iConfig.ExternalTrigInjecConv = HW_ADC_injectedExternalTriggerMapping[channelConfig->injectedTimerTrigger];
                    break;
            }

            iConfig.ExternalTrigInjecConvEdge = (channelConfig->injectedTriggerEdge == HW_ADC_TRIGGER_EDGE_RISING)
                                                    ? ADC_EXTERNALTRIGINJECCONV_EDGE_RISING
                                                    : ADC_EXTERNALTRIGINJECCONV_EDGE_FALLING;

            if (HAL_ADCEx_InjectedConfigChannel(&data->channelData[channel].hadc, &iConfig) != HAL_OK)
            {
                ret = false;
                break;
            }
        }
        data->channelData[channel].injectedConversionCompleteCallback = NULL;
    }

    // Cache derived state for run-time use.
    if ((ret) && (needsHALInit))
    {
        data->channelData[channel].numEnabledInputs         = numEnabledRegular;
        data->channelData[channel].numEnabledInjectedInputs = numEnabledInjected;
        for (uint8_t r = 0U; r < numEnabledRegular; r++)
        {
            data->channelData[channel].rankOrder[r] = rankOrder[r];
        }
        data->channelData[channel].numBits = HW_ADC_private_resolutionToNumBits(channelConfig->hadc.Init.Resolution);
    }

    return ret;
}

// [impl->fw~hal_adc_003~1]
// Arm the timer-triggered injected path. Runs only once the driver is in
// service, so a trigger landing immediately is serviced rather than dropped by
// the ISR's initialized guard. Software + polled injected is run1ms's job.
static bool HW_ADC_private_armTriggeredChannels(void)
{
    bool ret = true;
    for (size_t channel = 0U; channel < data->config->numChannels; channel++)
    {
        const HW_ADC_channelConfig_S * const channelConfig = &data->config->channels[channel];
        if ((ret) &&
            (data->channelData[channel].numEnabledInjectedInputs > 0U) &&
            (channelConfig->injectedXferMode == HW_ADC_XFER_INTERRUPT))
        {
            data->channelData[channel].injectedConversionStatus = HW_ADC_CONVERSION_STATUS_BUSY;
            ret = (HAL_ADCEx_InjectedStart_IT(&data->channelData[channel].hadc) == HAL_OK);
            if (ret)
            {
                // Start_IT arms per-conversion JEOC when EOCSelection is
                // SINGLE_CONV (the regular path's setting); this driver's
                // contract is sequence-complete, so arm JEOS instead.
                __HAL_ADC_DISABLE_IT(&data->channelData[channel].hadc, ADC_IT_JEOC);
                __HAL_ADC_ENABLE_IT(&data->channelData[channel].hadc, ADC_IT_JEOS);
            }
        }
    }
    return ret;
}

static HW_ADC_channels_E HW_ADC_private_channelFromHandle(ADC_HandleTypeDef * hadc)
{
    HW_ADC_channels_E channel = HW_ADC_CHANNEL_COUNT;
    for (size_t ch = 0U; ch < data->config->numChannels; ch++)
    {
        if (data->channelData[ch].hadc.Instance == hadc->Instance)
        {
            channel = ch;
            break;
        }
    }
    return channel;
}

// Called by HAL
// [impl->fw~hal_adc_008~1]
void HW_ADC_private_injectedConversionSequenceCompleteCallback(ADC_HandleTypeDef * hadc)
{
    if (data->initialized)
    {
        const HW_ADC_channels_E channel = HW_ADC_private_channelFromHandle(hadc);
        if (channel < HW_ADC_CHANNEL_COUNT)
        {
            HW_ADC_channelData_S * const channelData = &data->channelData[channel];

            for (uint8_t i = 0U; i < channelData->numEnabledInjectedInputs; i++)
            {
                channelData->injectedCounts[i] = HAL_ADCEx_InjectedGetValue(hadc, HW_ADC_injectedRankConstants[i]);
            }
            channelData->injectedConversionStatus = HW_ADC_CONVERSION_STATUS_OK;

            if (channelData->injectedConversionCompleteCallback != NULL)
            {
                channelData->injectedConversionCompleteCallback(channel,
                                                                channelData->injectedConversionStatus,
                                                                channelData->injectedConversionCompleteCallbackContext);
            }
        }
    }
}

// [impl->fw~hal_adc_008~1]
void HW_ADC_private_errorCallback(ADC_HandleTypeDef * hadc)
{
    if (data->initialized)
    {
        const HW_ADC_channels_E channel = HW_ADC_private_channelFromHandle(hadc);
        if (channel < HW_ADC_CHANNEL_COUNT)
        {
            HW_ADC_channelData_S * const channelData = &data->channelData[channel];

            channelData->errorCount++;
            channelData->injectedConversionStatus = HW_ADC_CONVERSION_STATUS_FAULT;

            if (channelData->injectedConversionCompleteCallback != NULL)
            {
                channelData->injectedConversionCompleteCallback(channel,
                                                                channelData->injectedConversionStatus,
                                                                channelData->injectedConversionCompleteCallbackContext);
            }
        }
    }
}

