PCSmithy/pcs_bldc/sw/lib/c/shared/hw/ADC/stm32g4/HW_ADC.c
void HW_ADC_irqHandler(void)
{
    if (data->initialized)
    {
        for (size_t channel = 0U; channel < data->config->numChannels; channel++)
        {
            // Only handles HAL_ADC_Init ran on (a channel with no enabled
            // inputs never gets one; its Instance stays NULL).
            if (data->channelData[channel].hadc.Instance != NULL)
            {
                HAL_ADC_IRQHandler(&data->channelData[channel].hadc);
            }
        }
    }
}

/* Public Function Definitions */

// [impl->fw~hal_adc_001~1]
bool HW_ADC_init(const HW_ADC_config_S * const config)
{
    bool ret = false;

    // Drop out of service before touching config or handles: the injected ISR
    // guards on initialized and would otherwise run against half-swapped state.
    *data = (HW_ADC_data_S){ 0 };

    if ((config != NULL) &&
        (config->channels != NULL) &&
        (config->numChannels <= HW_ADC_CHANNEL_COUNT))
    {
        data->config = config;

        bool success = true;
        for (size_t channel = 0U; channel < config->numChannels; channel++)
        {
            if (!HW_ADC_private_initOneChannel((HW_ADC_channels_E)channel))
            {
                success = false;
                break;
            }
        }

        if (success)
        {
            data->initialized = true;
            if (HW_ADC_private_armTriggeredChannels())
            {
                ret = true;
            }
            else
            {
                data->initialized = false;
            }
        }
    }
    return ret;
}

void HW_ADC_run1ms(void)
{
    if (data->initialized)
    {
        for (size_t channel = 0U; channel < data->config->numChannels; channel++)
        {
            const HW_ADC_channelConfig_S * const channelConfig = &data->config->channels[channel];
            HW_ADC_conversionStatus_E status = HW_ADC_CONVERSION_STATUS_IDLE;

            // Regular-sequence path. DMA / interrupt-driven channels
            // populate counts[] outside of _run1ms; only POLLED needs
            // per-tick service.
            // [impl->fw~hal_adc_004~1]
            const uint8_t numEnabledRegular = data->channelData[channel].numEnabledInputs;
            if ((channelConfig->xferMode == HW_ADC_XFER_POLLED) &&
                (numEnabledRegular > 0U))
            {
                status = HW_ADC_CONVERSION_STATUS_OK;

                // The injected JEOS ISR read-modify-writes State/ErrorCode on
                // this same handle and takes no HAL lock; BASEPRI cannot mask
                // it, so bracket the start's own read-modify-write.
                __disable_irq();
                const HAL_StatusTypeDef startStatus = HAL_ADC_Start(&data->channelData[channel].hadc);
                __enable_irq();

                if (startStatus == HAL_OK)
                {
                    for (uint8_t r = 0U; r < numEnabledRegular; r++)
                    {
                        if (HAL_ADC_PollForConversion(&data->channelData[channel].hadc, HW_ADC_POLL_TIMEOUT_MS) != HAL_OK)
                        {
                            // Timed out: record the fault, leave remaining counts stale.
                            status = HW_ADC_CONVERSION_STATUS_FAULT;
                            break;
                        }
                        const uint8_t input = data->channelData[channel].rankOrder[r];
                        data->channelData[channel].counts[input] = HAL_ADC_GetValue(&data->channelData[channel].hadc);
                    }
                    // ContinuousConvMode is DISABLE, so the peripheral stops itself
                    // when the sequence completes. No HAL_ADC_Stop needed.
                }
                else
                {
                    status = HW_ADC_CONVERSION_STATUS_FAULT;
                }
            }

            // Injected-sequence path. Same SW+POLLED gating; injected
            // preempts the regular sequence in hardware, but since we
            // run them sequentially here that's a non-issue. ISR/DMA
            // injected (the FOC use case) won't go through _run1ms.
            // [impl->fw~hal_adc_006~1]
            const uint8_t numEnabledInjected = data->channelData[channel].numEnabledInjectedInputs;
            if ((channelConfig->injectedXferMode == HW_ADC_XFER_POLLED) &&
                (numEnabledInjected > 0U))
            {
                if (status == HW_ADC_CONVERSION_STATUS_IDLE)
                {
                    status = HW_ADC_CONVERSION_STATUS_OK;
                }
                __disable_irq();
                const HAL_StatusTypeDef injectedStartStatus =
                    HAL_ADCEx_InjectedStart(&data->channelData[channel].hadc);
                __enable_irq();

                if (injectedStartStatus == HAL_OK)
                {
                    // HAL_ADCEx_InjectedPollForConversion waits for the
                    // entire injected sequence to complete (JEOS), then
                    // we read all values from the JDR registers.
                    if (HAL_ADCEx_InjectedPollForConversion(&data->channelData[channel].hadc, HW_ADC_POLL_TIMEOUT_MS) == HAL_OK)
                    {
                        for (uint8_t r = 0U; r < numEnabledInjected; r++)
                        {
                            data->channelData[channel].injectedCounts[r] =
                                HAL_ADCEx_InjectedGetValue(&data->channelData[channel].hadc, HW_ADC_injectedRankConstants[r]);
                        }
                    }
                    else
                    {
                        status = HW_ADC_CONVERSION_STATUS_FAULT;
                    }
                }
                else
                {
                    status = HW_ADC_CONVERSION_STATUS_FAULT;
                }
            }

            data->channelData[channel].status = status;
        }
    }
}

// [impl->fw~hal_adc_005~1]
bool HW_ADC_getCount(HW_ADC_channels_E channel, uint8_t inputIndex, uint32_t * const out)
{
    bool ret = false;
    if ((out != NULL) &&
        (data->initialized) &&
        (channel < HW_ADC_CHANNEL_COUNT) &&
        (inputIndex < HW_ADC_INPUTS_PER_CHANNEL) &&
        (data->config->channels[channel].inputs[inputIndex].enabled))
    {
        *out = data->channelData[channel].counts[inputIndex];
        ret = true;
    }
    return ret;
}

// [impl->fw~hal_adc_005~1]
bool HW_ADC_getVolts(HW_ADC_channels_E channel, uint8_t inputIndex, float32_t * const out)
{
    bool ret = false;
    if (out != NULL)
    {
        uint32_t counts = 0U;
        if (HW_ADC_getCount(channel, inputIndex, &counts))
        {
            const HW_ADC_channelConfig_S * const channelConfig = &data->config->channels[channel];
            const uint32_t maxCounts = (1UL << data->channelData[channel].numBits) - 1UL;

