PCSmithy/pcs_bldc/sw/lib/c/shared/hw/ADC/stm32g4/HW_ADC.c
            *out = ((float32_t)counts / (float32_t)maxCounts) * channelConfig->vref;
            ret = true;
        }
    }
    return ret;
}

// [impl->fw~hal_adc_006~1]
bool HW_ADC_getInjectedCount(HW_ADC_channels_E channel, uint8_t injectedIndex, uint32_t * const out)
{
    bool ret = false;
    if ((out != NULL) &&
        (data->initialized) &&
        (channel < HW_ADC_CHANNEL_COUNT) &&
        (injectedIndex < HW_ADC_INJECTED_INPUTS_PER_CHANNEL) &&
        (data->config->channels[channel].injectedInputs[injectedIndex].enabled))
    {
        *out = data->channelData[channel].injectedCounts[injectedIndex];
        ret = true;
    }
    return ret;
}

// [impl->fw~hal_adc_006~1]
bool HW_ADC_getInjectedVolts(HW_ADC_channels_E channel, uint8_t injectedIndex, float32_t * const out)
{
    bool ret = false;
    if (out != NULL)
    {
        uint32_t counts = 0U;
        if (HW_ADC_getInjectedCount(channel, injectedIndex, &counts))
        {
            const HW_ADC_channelConfig_S * const channelConfig = &data->config->channels[channel];
            const uint32_t maxCounts = (1UL << data->channelData[channel].numBits) - 1UL;

            *out = ((float32_t)counts / (float32_t)maxCounts) * channelConfig->vref;
            ret = true;
        }
    }
    return ret;
}

// [impl->fw~hal_adc_008~1]
bool HW_ADC_registerInjectedCallback(HW_ADC_channels_E channel,
                                     HW_ADC_injectedCallback_F callback,
                                     void * context)
{
    bool ret = false;
    if ((data->initialized) &&
        (channel < HW_ADC_CHANNEL_COUNT))
    {
        // may be NULL
        data->channelData[channel].injectedConversionCompleteCallback = callback;
        data->channelData[channel].injectedConversionCompleteCallbackContext = context;
        ret = true;
    }
    return ret;
}

// [impl->fw~hal_adc_008~1]
bool HW_ADC_getInjectedStatus(HW_ADC_channels_E channel,
                              HW_ADC_conversionStatus_E * const out)
{
    bool ret = false;
    if ((data->initialized) &&
        (channel < HW_ADC_CHANNEL_COUNT) &&
        (out != NULL))
    {
        *out = data->channelData[channel].injectedConversionStatus;
        ret = true;
    }
    return ret;
}

// [impl->fw~hal_adc_008~1]
bool HW_ADC_getErrorCount(HW_ADC_channels_E channel, uint32_t * const out)
{
    bool ret = false;
    if ((data->initialized) &&
        (channel < HW_ADC_CHANNEL_COUNT) &&
        (out != NULL))
    {
        *out = data->channelData[channel].errorCount;
        ret = true;
    }
    return ret;
}

// [impl->fw~hal_adc_004~1]
bool HW_ADC_getStatus(HW_ADC_channels_E channel, HW_ADC_conversionStatus_E * const out)
{
    bool ret = false;
    if ((out != NULL) &&
        (data->initialized) &&
        (channel < HW_ADC_CHANNEL_COUNT))
    {
        *out = data->channelData[channel].status;
        ret = true;
    }
    return ret;
}
